%--------------------------------------------------------------------------
%                   调用manova1函数作单因素多元方差分析
%--------------------------------------------------------------------------

% 从文件examp07_05.xls中读取数据
xdata = xlsread('examp07_05.xls');
% 提取xdata的第2至5列和第8至11列，即四种商品的销售额数据
x = [xdata(:,2:5); xdata(:,8:11)];
% 提取xdata的第6列和第12列，即销售方式数据
group = [xdata(:,6); xdata(:,12)];
% 调用manova1函数作多元方差分析
[d,p,stats] = manova1(x,group)

% 调用anova1函数对甲商品的销售额作一元方差分析
[p1,table1] = anova1(x(:,1),group)

% 调用anova1函数对乙商品的销售额作一元方差分析
[p2,table2] = anova1(x(:,2),group)

% 调用anova1函数对丙商品的销售额作一元方差分析
[p3,table3] = anova1(x(:,3),group)

% 调用anova1函数对丁商品的销售额作一元方差分析
[p4,table4] = anova1(x(:,4),group)