%--------------------------------------------------------------------------
%                     调用anova1函数作单因素一元方差分析
%--------------------------------------------------------------------------

%********************************读取数据***********************************
% 读取文件examp07_01.xls的第1个工作表中的数据
[x,y]=xlsread('examp07_01.xls');
% 提取矩阵x的第2列数据，即2077名同学的考试成绩数据
score = x(:,2);
% 提取元胞数组y的第4列的第2行至最后一行数据，即2077名同学所在学院的名称数据
college = y(2:end,4);
% 提取矩阵x的第1列数据，即2077名同学所在学院的编号数据
college_id = x(:,1);


%******************************正态性检验***********************************
% 调用lillietest函数分别对6个学院的考试成绩进行正态性检验
for i = 1:6
       scorei = score(college_id == i);  % 提取第i个学院的成绩数据
       [h,p] = lillietest(scorei);   % 正态性检验
       result(i,:) = p;   % 把检验的p值赋给result变量
   end
% 查看正态性检验的p值
result


%*****************************方差齐性检验**********************************
% 调用vartestn函数进行方差齐性检验
[p,stats] = vartestn(score,college)


%*******************************方差分析************************************
[p,table,stats] = anova1(score,college)  % 单因素一元方差分析


%*******************************多重比较************************************
[c,m,h,gnames] = multcompare(stats);  % 多重比较
% 设置表头，以元胞数组形式显示矩阵c
head = {'组序号','组序号','置信下限','组均值差','置信上限'};
[head; num2cell(c)]  % 将矩阵c转为元胞数组，并与head一起显示
[gnames num2cell(m)]  %将m转为元胞数组，并与gnames一起显示
