%--------------------------------------------------------------------------
%               读取examp09_05.xls中数据，进行模糊C均值聚类
%--------------------------------------------------------------------------

%*************************读取数据，并进行标准化变换*************************
% 从文件examp09_05.xls中读取数据
[xdata,textdata] = xlsread('examp09_05.xls');
% 提取元胞数组textdata第1列的第4行至最后一行，即城市名称数据
city = textdata(4:end,1);
% 调用zscore函数将平均气温数据矩阵xdata标准化
X = zscore(xdata);


%****************************进行模糊C均值聚类******************************
% 设置幂指数为3，最大迭代次数为200，目标函数的终止容限为1e-6，不显示中间迭代过程
options = [3, 200, 1e-6, 0];
% 调用fcm函数进行模糊C均值聚类，返回类中心坐标矩阵center，隶属度矩阵U，目标函数值obj_fcn
[center,U,obj_fcn] = fcm(X,3,options)


%******************************查看聚类结果*********************************
id1 = find(U(1,:) == max(U));  % 查找第1类中所有城市的序号
id2 = find(U(2,:) == max(U));  % 查找第2类中所有城市的序号
id3 = find(U(3,:) == max(U));  % 查找第3类中所有城市的序号
city(id1)  % 查看第1类所包含的城市
city(id2)  % 查看第2类所包含的城市
city(id3)  % 查看第3类所包含的城市
