%--------------------------------------------------------------------------
%               读取examp09_04.xls中数据，进行K均值聚类
%--------------------------------------------------------------------------

%*************************读取数据，并进行标准化变换*************************
[X, textdata] = xlsread('examp09_04.xls');  % 从Excel文件中读取数据
row = ~any(isnan(X), 2);  % 返回一个逻辑向量，非缺失观测对应元素1，缺失观测对应元素0
X = X(row, :);  % 剔除缺失数据，提取非缺失数据
countryname = textdata(3:end,1);  % 提取国家或地区名称，countryname为字符串元胞数组
countryname = countryname(row);  % 剔除缺失数据所对应的国家或地区名称

X = zscore(X);    % 数据标准化，即减去均值，然后除以标准差


%*************************选取初始凝聚点，进行聚类***************************
startdata = X([8, 27, 42],:);    % 选取第8、第27和第42个观测为初始凝聚点
idx = kmeans(X,3,'Start',startdata);    % 设置初始凝聚点，进行K均值聚类


%****************************** 绘制轮廓图 *********************************
[S, H] = silhouette(X,idx);    % 绘制轮廓图，并返回轮廓值向量S和图形句柄H



countryname(idx == 1)    % 查看第1类所包含的国家或地区
countryname(idx == 2)    % 查看第2类所包含的国家或地区
countryname(idx == 3)    % 查看第3类所包含的国家或地区