%--------------------------------------------------------------------------
%               读取examp09_03.xls中数据，进行变量系统聚类
%--------------------------------------------------------------------------

%*************************读取数据，并转为距离向量***************************
[X,textdata] = xlsread('examp09_03.xls');    % 从Excel文件中读取数据
y = 1 - X(X~=1 & ~isnan(X))'  % 提取X矩阵的不等于1和NaN的元素，并转为距离向量


%***********************调用linkage函数创建系统聚类树************************
Z = linkage(y,'average')    % 利用类平均法创建系统聚类树


%****************************** 绘制聚类树形图 *****************************
varlabel = textdata(2:end,1);    % 提取变量名称，为后面聚类做准备
% 作出聚类树形图，方向从右至左，显示所有叶节点，用变量名作为叶节点标签，叶节点标签在左侧
H = dendrogram(Z,0,'orientation','right','labels',varlabel);  % 返回线条句柄H
set(H,'LineWidth',2,'Color','k');    % 设置线条宽度为2，颜色为黑色
xlabel('并类距离（类平均法）')    % 为X轴加标签
