%--------------------------------------------------------------------------
%                    调用random函数生成卡方分布随机数
%--------------------------------------------------------------------------

% 调用random函数生成10000行1列的随机数向量x，其元素服从自由度为10的卡方分布
x = random('chi2', 10, 10000, 1);
[fp, xp] = ecdf(x);    % 计算经验累积概率分布函数值
ecdfhist(fp, xp, 50);    % 绘制频率直方图
hold on
t = linspace(0, max(x), 100);    % 等间隔产生一个从0到max(x)共100个元素的向量
y = chi2pdf(t, 10);    % 计算自由度为10的卡方分布在t中各点处的概率密度函数值
% 绘制自由度为10的卡方分布的概率密度函数曲线图，线条颜色为红色，线宽为3
plot(t, y, 'r', 'linewidth', 3) 
xlabel('x  ( \chi^2(10) )');    % 为X轴加标签
ylabel('f(x)');       % 为Y轴加标签
legend('频率直方图', '密度函数曲线')    % 为图形加标注框