%--------------------------------------------------------------------------
%      创建一个RandStream类对象，调用其randn方法生成标准正态分布随机数
%--------------------------------------------------------------------------

% 创建一个RandStream类对象s，其随机数生成器的算法为'mlfg6331_64'，初始种子为10
% 对象s的randn方法的算法为'Inversion'
s = RandStream('mlfg6331_64', 'seed', 10, 'RandnAlg', 'Inversion');

% 调用对象s的randn方法生成10行10列的随机数矩阵x，其元素服从标准正态分布
x = s.randn(10)
y = x(:);    % 将x按列拉长成一个列向量
hist(y)      % 绘制频数直方图
xlabel('标准正态分布随机数');    % 为X轴加标签
ylabel('频数');       % 为Y轴加标签
