%--------------------------------------------------------------------------
%             调用unifrnd函数和自编crnd函数生成均匀分布随机数
%--------------------------------------------------------------------------

rand('twister', 1);    % 设置随机数生成器的算法为Mersenne Twister算法，初始种子为1
% 调用unifrnd函数生成1000行1列的随机数向量x，其元素服从[0,6]上的均匀分布
x = unifrnd(0, 6, 1000, 1);

rand('twister', 1);    % 设置随机数生成器的算法为Mersenne Twister算法，初始种子为1
pdffun = '1/6';    % 密度函数表达式
% 调用crnd函数生成1000行1列的随机数向量y，其元素服从[0,6]上的均匀分布
y = crnd(pdffun, [0 6], 1000, 1);
scatterhist(x,y)    % 绘制x和y的散点图和边缘直方图
[x(1:10)  y(1:10)]'    % 查看x和y的前10个元素

sum(abs(x - y))    % 计算x和y的对应元素之差的绝对值之和