%--------------------------------------------------------------------------
%                    调用xlswrite函数写数据到文件
%--------------------------------------------------------------------------

x = rand(10);    % 生成一个10行10列的随机矩阵，其元素服从[0,1]上的均匀分布
% 把矩阵x写入文件examp02_15.xls的第2个工作表中的单元格区域D6:M15，并返回操作信息
[s,t] = xlswrite('examp02_15.xls', x, 2, 'D6:M15')

x = {1,60101,6010101,'陈亮',63,'';2,60101,6010102,'李旭',73,'';3,60101,...
6010103,'刘鹏飞',0,'缺考'}    % 定义一个元胞数组

% 把元胞数组x写入文件examp02_15.xls的指定工作表（xiezhh）中的单元格区域A3:F5
xlswrite('examp02_15.xls', x, 'xiezhh', 'A3:F5')

num = xlsread('examp02_14.xls');    % 读取文件examp02_14.xls中的数值型数据
% 把读取的数据num写入文件examp02_15.xls中的名称为'成绩'的工作表的默认区域
xlswrite('examp02_15.xls', num, '成绩')