%--------------------------------------------------------------------------
%                    调用fprintf函数写数据到文件或屏幕
%--------------------------------------------------------------------------

y = fprintf(1, '祝福我们伟大的新中国%d周岁生日快乐！！！', 60)    % 在屏幕上显示一句话

x = 10*rand(8,5);    % 产生一个8行5列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_01.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵x以指定格式写入文件examp02_01.txt
fprintf(fid,'%-f    %-f    %-f    %-f    %-f    %-f    %-f    %-f\n', x);
fclose(fid);    % 关闭文件

x = rand(6,5)/10000;   % 产生一个6行5列的随机矩阵，其元素服从[0,1/10000]上的均匀分布
fid = fopen('examp02_02.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵x以指定格式写入文件examp02_02.txt
fprintf(fid,'%-e  %-e  %-e  %-e  %-e  %-e\n', x);
fclose(fid);    % 关闭文件

x=10*rand(9,4);    % 产生一个9行4列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_03.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵x以指定格式写入文件examp02_03.txt
fprintf(fid,'%f,%f,%f,%f,%f,%f,%f,%f,%f\n',x);
fclose(fid);    % 关闭文件

x = 10*rand(5,4);    % 产生一个5行4列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_04.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵x以指定格式写入文件examp02_04.txt
fprintf(fid,'%-f    %-f,    %-f;    %-f*    %-f\n',x);
fclose(fid);    % 关闭文件

w = 10*rand(1,4);    % 产生一个1行4列的随机向量，其元素服从[0,10]上的均匀分布
x = 10*rand(1,3);    % 产生一个1行3列的随机向量，其元素服从[0,10]上的均匀分布
y = 10*rand(1,2);    % 产生一个1行2列的随机向量，其元素服从[0,10]上的均匀分布
z = 10*rand;         % 产生一个服从[0,10]上均匀分布的随机数
fid = fopen('examp02_05.txt','at');    % 以续写方式打开文件，返回文件标识符
% 把向量w,x,y,z分别以指定格式写入文件examp02_05.txt
fprintf(fid,'%-f    %-f    %-f    %-f\n', w);
fprintf(fid,'%-f    %-f    %-f\n', x);
fprintf(fid,'%-f    %-f\n', y);
fprintf(fid,'%-f\n', z);
fclose(fid);    % 关闭文件

x = 10*rand(1,3);    % 产生一个1行3列的随机向量，其元素服从[0,10]上的均匀分布
y = 10*rand(1,5);    % 产生一个1行5列的随机向量，其元素服从[0,10]上的均匀分布
z = 10*rand(1,4);    % 产生一个1行4列的随机向量，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_06.txt','at');    % 以续写方式打开文件，返回文件标识符
% 把向量x,y,z分别以指定格式写入文件examp02_06.txt
fprintf(fid,'%-f    %-f    %-f\n', x);
fprintf(fid,'%-f    %-f    %-f    %-f    %-f\n', y);
fprintf(fid,'%-f    %-f    %-f    %-f\n', z);
fclose(fid);    % 关闭文件

x = 10*rand(6,3);    % 产生一个6行3列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_07.txt','at');    % 以续写方式打开文件，返回文件标识符
% 往文件examp02_07.txt中写入两行文字
fprintf(fid,'这是%d行头文件，\n你可以选择跳过，读取后面的数据。\n', 2);
% 把矩阵x以指定格式写入文件examp02_07.txt
fprintf(fid,'%-f,    %-f,    %-f,    %-f,    %-f,    %f\n', x);
fclose(fid);    % 关闭文件

x = 10*rand(6,3);    % 产生一个6行3列的随机矩阵，其元素服从[0,10]上的均匀分布
y = 10*rand(3,2);    % 产生一个3行2列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_08.txt','at');    % 以续写方式打开文件，返回文件标识符
% 往文件examp02_08.txt中写入两行文字
fprintf(fid,'这是%d行头文件，\n你可以选择跳过，读取后面的数据。\n', 2);
% 把矩阵x以指定格式写入文件examp02_08.txt
fprintf(fid,'%-f    %-f    %-f    %-f    %-f    %f\n', x);
% 往文件examp02_08.txt中再写入两行文字
fprintf(fid,'这里还有两行文字说明和两行数据，\n看你还有没有办法！\n');
% 把矩阵y以指定格式写入文件examp02_08.txt
fprintf(fid,'%-f    %-f    %-f    %-f    %-f    %f\n', y);
fclose(fid);    % 关闭文件

x = 10*rand(2,12);    % 产生一个2行12列的随机矩阵，其元素服从[0,10]上的均匀分布
fid = fopen('examp02_09.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵x以指定格式写入文件examp02_09.txt
fprintf(fid,'%f+%fi, %f+%fi, %f+%fi, %f+%fi\n', x);
fclose(fid);    % 关闭文件

dt = [2009 08 19 10 39 56.171
         2009 08 20 10 39 56.171
         2009 08 21 10 39 56.171
         2009 08 22 10 39 56.171]';       % 定义一个4行6列的矩阵
fid = fopen('examp02_10.txt','wt');    % 以写入方式打开文件，返回文件标识符
% 把矩阵dt以指定格式写入文件examp02_10.txt
fprintf(fid,'%d-%d-%d,  %d:%d:%5.3f AM\n', dt);  
fclose(fid);    % 关闭文件

x = ['xiezh'; 'yanlh'; 'liaoj'; 'lijun'; 'xiagk'];    % 定义一个字符矩阵
y = [18 16 15 20 15]';    % 定义一个列向量
z = [170 160 160 175 172]';    % 定义一个列向量
w = [65 52 50 70 56]';    % 定义一个列向量
fid = fopen('examp02_11.txt','at');    % 以续写方式打开文件，返回文件标识符
fm = 'Name: %s Age: %d Height: %d Weight: %d kg\n';    % 定义写入格式
% 通过循环将x,y,z和w按指定格式写入文件examp02_11.txt
for i = 1:5    
       fprintf(fid, fm, x(i,:),y(i),z(i),w(i));
   end
fclose(fid);    % 关闭文件


x = [1 2 3; 4 5 6; 7 8 9; 10 11 12]    % 定义一个4行3列的矩阵
% 把矩阵x以指定格式显示在屏幕上
fprintf(1, '    %-d    %-d    %-d    %d\n', x);
