%--------------------------------------------------------------------------
%             读取原始数据，调用自编函数reglm作5重线性回归
%--------------------------------------------------------------------------

%*********************************读取数据**********************************
% 从Excel文件examp08_03.xls中读取数值型数据
xydata = xlsread('examp08_03.xls');
y = xydata(:, 2);    % 提取矩阵xydata的第2列数据，即耗氧能力数据y
X = xydata(:, 3:7);    % 提取矩阵xydata的第3至7列数据，即自变量观测值矩阵X


%*********调用reglm函数作5重线性回归显示回归分析的方差分析表和参数估计表*******
reglm(y,X)


%--------------------------------------------------------------------------
%             剔除不显著变量，调用自编函数reglm作3重线性回归
%--------------------------------------------------------------------------

X135 = X(:,[1 3 5]);    % 提取矩阵X的第1，3，5列
varnames = {'X1','X3','X5'};    % 定义变量标签
reglm(y, X135, [], varnames);    % 调用reglm函数重新作3重线性回归


%--------------------------------------------------------------------------
%                   调用自编函数reglm作完全二次回归
%--------------------------------------------------------------------------

reglm(y,X,'quadratic')    % 调用reglm函数作完全二次回归


%--------------------------------------------------------------------------
%                      绘制以上3次拟合的拟合效果图
%--------------------------------------------------------------------------

s1 = reglm(y,X);    % 调用reglm函数作5重线性回归拟合

X135 = X(:,[1 3 5]);    % 提取矩阵X的第1，3，5列
varnames = {'X1','X3','X5'};    % 定义变量标签
s2 = reglm(y, X135, [], varnames);    % 调用reglm函数作3重线性回归拟合

s3 = reglm(y,X,'quadratic');    % 调用reglm函数作完全二次回归拟合

% 绘制拟合效果图
figure;    % 新建图形窗口
plot(y,'ko');    % 绘制因变量y与观测序号的散点
hold on
plot(s1.yhat,':','linewidth',2);    % 绘制5重线性回归的拟合效果图，蓝色虚线
plot(s2.yhat,'r-.','linewidth',2);    % 绘制3重线性回归的拟合效果图，红色点划线
plot(s3.yhat,'k','linewidth',2);    % 绘制完全二次回归的拟合效果图，黑色实线
legend('y的原始散点','5重线性回归拟合','3重线性回归拟合','完全二次回归拟合'); % 标注框
xlabel('y的观测序号');    % 为X轴加标签
ylabel('y');    % 为Y轴加标签