%--------------------------------------------------------------------------
%                         正态总体参数的检验
%--------------------------------------------------------------------------

% 例5.2
%*****************总体标准差已知时的单个正态总体均值的检验********************
x = [97  102  105  112  99  103  102  94  100  95  105  98  102  100  103];    % 定义样本观测值向量
% 调用ztest函数作总体均值的双侧检验，
% 返回变量h，检验的p值，均值的置信区间muci，检验统计量的观测值zval
[h,p,muci,zval] = ztest(x,100,2,0.05)

% 调用ztest函数作总体均值的单侧检验，
% 返回变量h，检验的p值，均值的置信区间muci，检验统计量的观测值zval
[h,p,muci,zval] = ztest(x,100,2,0.05,'right')



% 例5.3
%******************总体标准差未知时的单个正态总体均值的检验*******************
x = [49.4  50.5  50.7  51.7  49.8  47.9  49.2  51.4  48.9];    % 定义样本观测值向量
% 调用ttest函数作总体均值的双侧检验，
% 返回变量h，检验的p值，均值的置信区间muci，结构体变量stats
[h,p,muci,stats] = ttest(x,50,0.05)


% 例5.4
%*****************总体标准差未知时的两个正态总体均值的比较检验****************
% 定义甲机床对应的样本观测值向量
x = [20.1,  20.0,  19.3,  20.6,  20.2,  19.9,  20.0,  19.9,  19.1,  19.9];
% 定义乙机床对应的样本观测值向量
y = [18.6,  19.1,  20.0,  20.0,  20.0,  19.7,  19.9,  19.6,  20.2];
alpha = 0.05;    % 显著性水平为0.05
tail = 'both';    % 尾部类型为双侧
vartype = 'equal';    % 方差类型为等方差
% 调用ttest2函数作两个正态总体均值的比较检验，
% 返回变量h，检验的p值，均值差的置信区间muci，结构体变量stats
[h,p,muci,stats] = ttest2(x,y,alpha,tail,vartype)


% 例5.5
%*******************总体均值未知时的单个正态总体方差的检验********************
% 定义样本观测值向量
x = [49.4  50.5  50.7  51.7  49.8  47.9  49.2  51.4  48.9];
var0 = 1.5;    % 原假设中的常数
alpha = 0.05;    % 显著性水平为0.05
tail = 'both';    % 尾部类型为双侧
% 调用vartest函数作单个正态总体方差的双侧检验，
% 返回变量h，检验的p值，方差的置信区间varci，结构体变量stats
[h,p,varci,stats] = vartest(x,var0,alpha,tail)


% 例5.6
%*****************总体均值未知时的两个正态总体方差的比较检验******************
% 定义甲机床对应的样本观测值向量
x = [20.1,  20.0,  19.3,  20.6,  20.2,  19.9,  20.0,  19.9,  19.1,  19.9];
% 定义乙机床对应的样本观测值向量
y = [18.6,  19.1,  20.0,  20.0,  20.0,  19.7,  19.9,  19.6,  20.2];
alpha = 0.05;    % 显著性水平为0.05
tail = 'both';    % 尾部类型为双侧
% 调用vartest2函数作两个正态总体方差的比较检验，
% 返回变量h，检验的p值，方差之比的置信区间varci，结构体变量stats
[h,p,varci,stats] = vartest2(x,y,alpha,tail)